title: Registry Hive Export via Reg.exe
id: 48e833a4-84d5-4127-a06d-a16f29ef199e
status: experimental
description: Detects the export of sensitive registry hives (SAM, SECURITY, SYSTEM) using reg.exe, often used for credential dumping.
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: '\reg.exe'
    OriginalFileName: 'reg.exe'
  selection_cmd:
    CommandLine|contains: 'save'
  selection_hives:
    CommandLine|contains:
      - '\sam'
      - '\security'
      - '\system'
  selection_path:
    CommandLine|contains:
      - 'C:\ProgramData\'
      - '%ProgramData%'
  condition: selection_img and selection_cmd and selection_hives and selection_path
falsepositives:
  - Extremely unlikely for reg backups to be staged in C:\ProgramData.
level: critical
tags:
  - attack.credential_access
  - attack.t1003.002