title: VSSAdmin Shadow Copy Creation
id: 38ca1076-2f5b-4333-8208-8f520935105b
status: experimental
description: Detects the use of vssadmin.exe to create a new volume shadow copy, which can be used to extract NTDS.dit or other sensitive files.
references:
  - https://attack.mitre.org/techniques/T1003/003/
date: 2026/02/09
tags:
  - attack.credential_access
  - attack.t1003.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    - Image|endswith: '\vssadmin.exe'
    - OriginalFileName: 'vssadmin.exe'
  selection_cmd:
    CommandLine|contains|all:
      - 'create'
      - 'shadow'
  condition: selection_img and selection_cmd
falsepositives:
  - Administrative backup scripts
  - Volume Shadow Copy Service software installers
level: medium