title: Wireless Network Enumeration via Netsh
id: 54b23456-e89b-4c1b-9a2c-1234567890ab
status: experimental
description: |
  Detects enumeration of wireless networks for nearest neighbour movement. 
  We assume that normal users would perform wlan activities through the GUI and using netsh indicates admin or attacker activity.
author: Chang
date: 2026/02/21
modified: 2026/02/21
tags:
  - attack.reconnaissance
  - attack.discovery
  - attack.t1016
logsource:
  category: process_creation
  product: windows
detection:
  selection_proc:
    Image|endswith: '\netsh.exe'
  selection_args:
    CommandLine|contains|all:
      - 'wlan'
      - 'show'
  selection_cmd:
    CommandLine|contains:
      - 'all'
      - 'networks'
  condition: selection_proc and selection_args and selection_cmd
fields:
  - User
  - Image
  - CommandLine
  - CurrentDirectory
falsepositives:
  - Legitimate administrative network troubleshooting
level: medium
